# IO_Database
#### Table of Contents
1. SQLite

## SQLite
### Importing

In [1]:
import pandas as pd
import sqlite3

In [2]:
# creating a database with sqlite3
conn = sqlite3.connect("mydb.db")
cur = conn.cursor()

In [3]:
cur.execute("""
CREATE TABLE IF NOT EXISTS people (
    ssn INTEGER PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    age INTEGER
)
""")

In [4]:
cur.execute("""
INSERT INTO people (ssn, name, age) VALUES
(1, 'Mike', 25),
(90, 'Anna', 35),
(7193, 'Bob', 76),
(1231, 'John', 55),
(2313, 'Stan', 18)
""")

conn.commit()

In [5]:
# importing database to pandas
sql = pd.read_sql_query("SELECT * FROM people", conn)
df = pd.DataFrame(sql, columns=["ssn", "name", "age"])

print(df)

    ssn  name  age
0     1  Mike   25
1    90  Anna   35
2  1231  John   55
3  2313  Stan   18
4  7193   Bob   76

In [6]:
df.set_index("ssn", inplace=True)
print(df)

      name  age
ssn
1     Mike   25
90    Anna   35
1231  John   55
2313  Stan   18
7193   Bob   76

### Exporting

In [7]:
# Pandas to SQL
new_df = pd.DataFrame({
    "ssn": [132, 234, 456],
    "name": ["Fox", "Lion", "Cat"],
    "age": [50, 34, 56]
})
new_df

   ssn  name  age
0  132   Fox   50
1  234  Lion   34
2  456   Cat   56

In [8]:
new_df.to_sql("people", con=conn, if_exists="append", index=False)

3

In [9]:
# To View
sql = pd.read_sql_query("SELECT * FROM people", conn)
df = pd.DataFrame(sql, columns=["ssn", "name", "age"])

print(df)

    ssn  name  age
0     1  Mike   25
1    90  Anna   35
2   132   Fox   50
3   234  Lion   34
4   456   Cat   56
5  1231  John   55
6  2313  Stan   18
7  7193   Bob   76